[
  {
    "id": 1,
    "title": "인공지능의 역사",
    "content": "인공지능(AI)의 역사는 1950년대부터 시작됩니다. 앨런 튜링은 1950년에 '기계가 생각할 수 있는가?'라는 질문을 담은 논문을 발표했습니다. 이후 1956년 다트머스 회의에서 '인공지능'이라는 용어가 처음 사용되었습니다."
  },
  {
    "id": 2,
    "title": "딥러닝의 발전",
    "content": "딥러닝은 2010년대부터 급속도로 발전했습니다. 2012년 AlexNet이 ImageNet 대회에서 우승하면서 딥러닝 열풍이 시작되었고, 이후 이미지 인식, 자연어 처리 등 다양한 분야에서 혁신을 가져왔습니다."
  },
  {
    "id": 3,
    "title": "자연어 처리 기술",
    "content": "자연어 처리(NLP)는 컴퓨터가 인간의 언어를 이해하고 처리하는 기술입니다. 최근에는 트랜스포머 아키텍처를 기반으로 한 BERT, GPT 등의 모델이 혁신적인 성능을 보여주고 있습니다."
  },
  {
    "id": 4,
    "title": "강화학습의 원리",
    "content": "강화학습은 에이전트가 환경과 상호작용하며 보상을 최대화하는 방향으로 학습하는 방법입니다. Q-learning, Policy Gradient, Actor-Critic 등 다양한 알고리즘이 있으며, 알파고와 같은 게임 AI에 성공적으로 적용되었습니다."
  },
  {
    "id": 5,
    "title": "컴퓨터 비전 기술",
    "content": "컴퓨터 비전은 컴퓨터가 이미지나 비디오를 이해하는 기술입니다. CNN(Convolutional Neural Network)을 통해 이미지 분류, 객체 탐지, 이미지 분할 등의 작업이 가능해졌으며, 자율주행차, 의료 영상 분석 등에 활용됩니다."
  },
  {
    "id": 6,
    "title": "RAG(Retrieval-Augmented Generation)의 개념",
    "content": "RAG는 검색 증강 생성 모델로, 외부 지식을 검색하여 언어 모델의 생성 품질을 향상시키는 방법입니다. 언어 모델이 가지고 있지 않은 최신 정보나 특정 도메인 지식을 제공할 수 있어 환각 현상을 줄이고 정확도를 높일 수 있습니다."
  },
  {
    "id": 7,
    "title": "임베딩 기술의 발전",
    "content": "임베딩은 고차원의 데이터를 저차원 벡터로 표현하는 기술입니다. Word2Vec, GloVe와 같은 단어 임베딩에서 시작해 현재는 문장, 문서 단위의 임베딩까지 발전했으며, 의미적 유사성을 벡터 공간에 효과적으로 매핑합니다."
  },
  {
    "id": 8,
    "title": "트랜스포머 아키텍처",
    "content": "트랜스포머는 2017년 'Attention is All You Need' 논문에서 소개된 신경망 아키텍처로, 자기 주의(self-attention) 메커니즘을 기반으로 합니다. RNN의 한계를 극복하고 병렬 처리가 가능해 효율적이며, 현대 대부분의 언어 모델의 기반이 되었습니다."
  },
  {
    "id": 9,
    "title": "정보 검색 시스템의 평가 지표",
    "content": "정보 검색 시스템은 정확도(Precision), 재현율(Recall), F1 점수, MAP(Mean Average Precision), NDCG(Normalized Discounted Cumulative Gain) 등 다양한 지표로 평가됩니다. 이러한 지표들은 검색 결과의 품질과 관련성을 측정합니다."
  },
  {
    "id": 10,
    "title": "벡터 데이터베이스",
    "content": "벡터 데이터베이스는 임베딩 벡터를 효율적으로 저장하고 검색하기 위한 특수 데이터베이스입니다. Faiss, Pinecone, Milvus 등이 대표적이며, ANN(Approximate Nearest Neighbor) 알고리즘을 사용해 대규모 벡터 검색을 빠르게 수행합니다."
  }
]